// 职称
const userJobTitleEnum = {
  10: '初级职称',
  20: '中级职称',
  30: '高级职称',
  40: '无职称'

}

// 职务
const userPositionEnum = {
  10: '部党组书记',
  20: '部长',
  30: '副部长',
  40: '政治部主任',
  50: '部纪检组组长',
  60: '总工程师',
  70: '局长',
  80: '副局长',
  90: '司长',
  100: '副司长',
  110: '厅长',
  120: '副厅长',
  130: '纪检组组长',
  140: '纪检组副组长',
  150: '监察专员',
  160: '一级巡视员',
  170: '二级巡视员',
  180: '主任',
  190: '副主任',
  200: '处长'
}

// 人员类型
const userTypeEnum = {
  1: '借调',
  20: '挂职',
  30: '正式',
  999: '测试'

}

export default {
  userJobTitleEnum,
  userPositionEnum,
  userTypeEnum
}
